<template>
  <div class="flex flex-col md:flex-row gap-6">
    <div class="md:w-1/4 font-bold text-4xl">
      Почему это важно?
    </div>
    <div class="md:w-3/4 flex flex-col gap-6">
      <QuestionsItem v-for="question in questions" :key="question.title" :question="question" />
    </div>
  </div>
</template>

<script setup lang="ts">
import QuestionsItem from './QuestionsItem.vue'

const questions = [
  {
    title: 'Здоровое развитие',
    answer: 'Контроль и анализ состава детского питания позволяют убедиться, что оно содержит все необходимые питательные вещества, такие как белки, углеводы, жиры, витамины и минералы, необходимые для правильного развития и роста ребенка.'
  },
  {
    title: 'Предотвращение ожирения',
    answer: 'Анализ состава детского питания позволяет убедиться, что оно не содержит избыточного количества сахара, соли и жиров, что помогает предотвратить ожирение у детей.'
  },
  {
    title: 'Укрепление иммунитета',
    answer: 'Питательные вещества, такие как витамины C, D, E и B6, а также железо, цинк и селен, способствуют укреплению иммунитета у детей. Анализ состава детского питания позволяет убедиться, что оно содержит достаточное количество этих питательных веществ.'
  },
  {
    title: 'Улучшение когнитивных способностей',
    answer: 'Некоторые питательные вещества, такие как омега-3-ненасыщенные жирные кислоты, фолиевая кислота, витамин B12 и железо, способствуют развитию когнитивных способностей у детей. Анализ состава детского питания позволяет убедиться, что оно содержит достаточное количество этих питательных веществ.'
  },
  {
    title: 'Предотвращение аллергий',
    answer: 'Анализ состава детского питания позволяет убедиться, что оно не содержит продуктов, которые могут вызвать аллергии у ребенка, таких как яйца, молоко, пшеница, соя и морепродукты.'
  },
]
</script>